{
	"COMMENT": [
		"This is the SAMPLE configuration file for TuxTwitchTalker.",
		"All text surrounded by percent signs needs to be replaced.",
		"All lines starting with COMMENT are documentation, and can be removed"
	],
	"COMMENT": "Username for the bot.  Must be a real Twitch username, may be your own username",
	"BOT_NAME": "%BOT_NAME%",
	"COMMENT": "Generate this value from https://twitchapps.com/tmi/ logged in as the above user",
	"TMI_OAUTH": "oauth:%OAUTH_HASH%",
	"COMMENT": [
		"Command line program (with path) to play media files",
		"The VLC command below works well for me on both Linux and Windows as long as vlc is in your path",
		"MEDIAFILE will be replaced by the name of the file to play"
	],
	"MEDIA_PLAYER_COMMAND": "vlc -I dummy --play-and-exit MEDIAFILE",
	"COMMENT": "This is a list of usernames that the bot should not respond to.  Add all your other bots here.",
	"IGNORE_USERS": [
		"Streamlabs",
		"streamlabs",
		"pretzelrocks"
	],
	"COMMENT": "This is a list of admin users that can use !! admin commands.  Make sure to add yourself and trusted mods.",
	"ADMIN_USERS": [
		"%YOUR_USERNAME%",
		"%YOUR_MODS_USERNAME%"
	],
	"COMMENT": "Your channel name that the bot should log into (this may change when multi-tenant is implemented)",
	"CHANNELS": [
		"%YOUR_CHANNEL_NAME%"
	],
	"COMMENT": [
		"This is a list of regulars in your channel, and how you would like them",
		"to be greeted when they chat for the first time in the session.",
		"If the user doesn't have an entry and they are a mod, the message on the *default_mod* line will be used.",
		"If the user doesn't have an entry and they are a VIP, the message on the *default_vip* line will be used.",
		"If the user doesn't have an entry and they are not a mod/vip, the message on the *default* line will be used.",
		"Within the users or the defaults, the following keys are valid:",
		"   CHAT: Write the message into the stream's chat",
		"   MEDIA: Play a media file",
		"   SHOUTOUT: Write a shoutout command into the stream's chat (NOTE it just issues the command, it can't do the shoutout itself).",
		"For all messages, the word USERNAME will be replaced with the user's real username.",
		"This is true of media files too, so if you choose to name your media files with the username in them you can just put USERNAME in the file name and it will load the right one",
		"If a user has a CHAT entry but no MEDIA entry, the default MEDIA entry will be used, and vice verse."	],
	"GREETINGS": {
		"heather_gamer": {
			"CHAT":			"Welcome, USERNAME! Man of mystery!",
			"MEDIA":		"../sounds/order66.mp3"
		},
		"momsspaghetti": {
			"MEDIA":		"../sounds/get-lucky-daft-punk-flute-cover-50.mp3"
		},
		"Bunicula": {
			"CHAT":			"Hey everyone! USERNAME is here! Let's all tell them how much we appreciate them",
			"MEDIA":		"../sounds/chicken_1.mp3"
		},
		"will_shand": {
			"CHAT":			"Our fellow streamer USERNAME is here!",
			"MEDIA":		"../sounds/i_like_turtles.mp3",
			"SHOUTOUT":		"!so USERNAME"
		},
		"default_mod": {
			"CHAT":			"Welcome to the chat, USERNAME! MOD IN DA HOUSE! Everyone look busy! BibleThump BibleThump BibleThump ",
			"MEDIA":		"../sounds/hello_doubtfire.mp3"
		},
		"default_vip": {
			"CHAT":			"Welcome to the chat, USERNAME! VIP IN DA HOUSE! Give them some space! BibleThump BibleThump BibleThump ",
			"MEDIA":		"../sounds/hello_doubtfire.mp3"
		},
		"default": {
			"CHAT":			"Welcome to the chat, USERNAME!",
			"MEDIA":		"../sounds/hello_doubtfire.mp3"
		}
	},

	"COMMENT": [
		"This is a list of commands and associated text files.",
		"When the command is executed, the reply will be a random line from the specified file.",
		"This can be used for replying with random facts, quotes, etc."
	],
	"RANDOM_FILE_LINE_COMMANDS": {
		"!dadjoke":		"./data/dadjokes.txt"
	},
	"COMMENT": [
		"Response commands are commands that the bot replies to with a canned message",
		"(can be used for listing alerts, social links, etc.).",
		"For all messages, the word USERNAME will be replaced with the user's real username."
	],
		"RESPONSE_COMMANDS": {
		"!boss":		"YOU are the boss, USERNAME."
	},
	"COMMENT": [
		"Command Feature Flags can turn on or off the pre-programmed commands",
		"If the value is 'true', then that command will be enabled, otherwise it will be disabled."
	],
	"COMMANDS_FEATURE_FLAGS": {
		"dice": 		"true",
		"timer":		"true",
		"counter":		"true",
		"webserver":	"true"
	},
	"COMMENT": [
		"Periodic messages will be posted in chat... periodically.  Each entry in the array has three fields",
		"TITLE is what you call the message.  It doesn't get printed but it is logged when it loads.",
		"INTERVAL is the number of minutes between posting the message",
		"TEXT is the text to display in chat.",
		"It's a good idea to not have the intervals the same or multiples so the messages don't print right after each other",
		"In the future the message title may be used to cancel or change frequency of messages live"
	],
	"PERIODIC_MESSAGES": [
		{
			"TITLE": 	"first_message",
			"INTERVAL": 20,
			"TEXT":		"Print this in chat ever 20 minutes"
		},
		{
			"TITLE": 	"second_message",
			"INTERVAL": 25,
			"TEXT":		"Print this in chat ever 25 minutes"
		},
		{
			"TITLE": 	"third_message",
			"INTERVAL": 30,
			"TEXT":		"Print this in chat ever 30 minutes"
		}
	],
	"COMMENT": [
		"Triggered messages are messages that are sent when a word or phrase appears in chat.",
		"As with greetings, they can be CHAT or MEDIA",
		"The word or phrase should be expressed as a regular expression",
		"(see https://www.oreilly.com/content/an-introduction-to-regular-expressions/)",
		"If you don't want to learn regular expressions, just use the word or phrase"
	],
	"TRIGGERED_MESSAGES": {
		"cat": {
			"CHAT":		"Cat was mentioned",
			"MEDIA":	"../sounds/cat-meow-short_nice.mp3"
		},
		"[^a-zA-Z0-9]cat[^a-zA-Z0-9]": {
			"CHAT":		"Cat was mentioned, but guarantees its the word 'cat', not just 'cat' anywhere on the line, including part of another word",
			"MEDIA":	"../sounds/cat-meow-short_nice.mp3"
		},
		"^cat": {
			"CHAT":		"Cat was mentioned at the beginning of a line",
			"MEDIA":	"../sounds/cat-meow-short_nice.mp3"
		},
		"COMMENT": [
			"Timers are created by the !!timer command.  When the timer runs out, these alerts will be triggered.  All timers use the same alerts",
			"The word TIMERNAME will be replaced with the name of the timer given when created, so you can use different media files for each."
		],
		"TIMER_ALERT": {
			"CHAT":		"Timer TIMERNAME is done!",
			"MEDIA":	"../sounds/ding-sound-effect_2.mp3"
		}
	}
}
