{
	"COMMENT_INTRO": [
		"This is the SAMPLE configuration file for TuxTwitchTalker.",
		"This file is in JSON format.  See https://en.wikipedia.org/wiki/JSON for an explanation and documentation on that format.",
		"All lines starting with COMMENT are documentation for the user, and don't affect the program.",
		"The program will look for a file 'config.json', so start by copying this file to 'config.json' in the directory the bot is run from",
		"then modifying it with your values.  The first few entries, with your identity and the identity the bot should run as are the most important.",
		"You can specify a different filename as the first parameter on the command line.",
		"TIPS:",
		"- For 'CHAT', 'MEDIA', and 'SHOUTOUT' entries, multiple values can be specified, and one will be chosen at random.",
		"  This means a random greeting/sound effect/response will be chosen.  There are several examples of this in this sample file",
		"- For 'CHAT', 'MEDIA', and 'SHOUTOUT' entries, the string USERNAME in the value will be replaced by the username it's responding to, for personalization.",
		"- All of the 'CHAT', 'MEDIA', and 'SHOUTOUT' entries are optional.  If you don't want anything to appear in chat, or don't want a media file to play, just leave them out.",
		"- Most features that do not rely on explicit configuration in this file can be enabled or disabled in the 'COMMANDS_FEATURE_FLAGS' section."
	],
	"COMMENT_BOT_NAME": "Username for the bot.  Must be a real Twitch username, may be your own username",
	"BOT_NAME": "YourBotName",
	"COMMENT_TMI_OAUTH": "Generate this value from https://twitchapps.com/tmi/ logged in as the above user",
	"TMI_OAUTH": "oauth:%OAUTH_HASH%",
	"COMMENT_MEDIA_PLAYER_COMMAND": [
		"Command line program (with path) to play media files",
		"The VLC command below works well for me on both Linux and Windows as long as vlc is in your path",
		"the word MEDIAFILE in the command will be replaced by the name of the file to play"
	],
	"MEDIA_PLAYER_COMMAND": "vlc -I dummy --play-and-exit MEDIAFILE",
	"COMMENT_IGNORE_USERS": [
		"This is a list of usernames that the bot should not respond to.  Add all your other bots here.",
		"It's important to add this bot to the list (whatever username you give it) so it doesn't start talking to itself :)"
	],
	"IGNORE_USERS": [
		"streamlabs",
		"pretzelrocks"
	],
	"COMMENT_ADMIN_USERS": [
		"This is a list of users that can use !! admin commands.  Make sure to add yourself and trusted mods/VIPs."
	],
	"ADMIN_USERS": [
		"LinuxLovah",
		"MyTrustedMod"
	],
	"COMMENT_CHANNELS": [
		"Your channel name that the bot should log into"
	],
	"CHANNELS": [
		"LinuxLovah"
	],
	"COMMENT_COMMANDS_FEATURE_FLAGS": [
		"Command Feature Flags can turn on or off the pre-programmed commands",
		"If the value is 'true', then that command will be enabled, otherwise it will be disabled."
	],
	"COMMANDS_FEATURE_FLAGS": {
		"dice": 		"true",
		"timer":		"true",
		"counter":		"true",
		"webserver":	"true",
		"greetings":	"true"
	},
	"COMMENT_GREETINGS": [
		"This is a list of regulars in your channel, and how you would like them",
		"to be greeted when they chat for the first time in the session (or since the bot started.",
		"There are admin commands to add or remove someone from the 'seen list' and to test a greeting for a particular user.",
		"If the user doesn't have an entry and they are a mod, the greetings on the 'default_mod' entry will be used.",
		"If the user doesn't have an entry and they are a VIP, the greetings on the 'default_vip' entry will be used.",
		"If the user doesn't have an entry and they are not a mod/vip, the message on the 'default' entry will be used.",
		"Within the users or the defaults, the following entries are valid:",
		"   CHAT: Write the message into the stream's chat",
		"   MEDIA: Play a media file",
		"   SHOUTOUT: Write a shoutout command into the stream's chat (NOTE it just issues the command, which is usually !so USERNAME, it can't do the shoutout itself)."
	],
	"GREETINGS": {
		"heather_gamer": {
			"CHAT":			["Welcome, USERNAME! Woman of mystery!", "Hey everyone! USERNAME is here!"],
			"MEDIA":		["../sounds/order66.mp3", "../sounds/henlo.mp3"]
		},
		"momsspaghetti": {
			"MEDIA":		"../sounds/get-lucky-daft-punk-flute-cover-50.mp3"
		},
		"Bunicula": {
			"CHAT":			"Hey everyone! USERNAME is here! Let's all tell them how much we appreciate them",
			"MEDIA":		"../sounds/chicken_1.mp3"
		},
		"will_shand": {
			"CHAT":			"Our fellow streamer USERNAME is here!",
			"MEDIA":		"../sounds/i_like_turtles.mp3",
			"SHOUTOUT":		"!so USERNAME"
		},
		"default_mod": {
			"CHAT":			"Welcome to the chat, USERNAME! MOD IN DA HOUSE! Everyone look busy! BibleThump BibleThump BibleThump ",
			"MEDIA":		"../sounds/hello_doubtfire.mp3"
		},
		"default_vip": {
			"CHAT":			"Welcome to the chat, USERNAME! VIP IN DA HOUSE! Give them some space! BibleThump BibleThump BibleThump ",
			"MEDIA":		"../sounds/hello_doubtfire.mp3"
		},
		"default": {
			"CHAT":			["Welcome to the chat, USERNAME!", "USERNAME is here!"],
			"MEDIA":		["../sounds/hello_doubtfire.mp3", "../sounds/greetings.mp3"]
		}
	},
	"COMMENT_RANDOM_FILE_LINE_COMMANDS": [
		"This is a list of commands and associated text files.",
		"When the command is executed, the reply will be a random line from the specified file.",
		"This can be used for replying with random facts, quotes, insults, etc.",
		"This is a powerful feature that not many streamers will use, but was one of the motivations for writing this bot, as I use it."
	],
	"RANDOM_FILE_LINE_COMMANDS": {
		"!dadjoke":		"./data/dadjokes.txt"
	},
	"COMMENT_PERIODIC_MESSAGES": [
		"Periodic messages will be posted in chat... periodically.",
		"This can be used for social media links, channel rules, notes on redeemables, etc.",
		"INTERVAL is the number of minutes between posting the message.  It can be a fraction (ie 30.3)",
		"CHAT is the text to display in chat.",
		"It's a good idea to not have the intervals the same or multiples so the messages don't print right after each other"
	],
	"PERIODIC_MESSAGES": {
		"first_message": {
			"INTERVAL": 20,
			"CHAT":		["Print this in chat ever 20 minutes", "But sometimes say this instead"],
			"MEDIA":	"../sounds/ding-sound-effect_2.mp3"
		},
		"second_message": {
			"INTERVAL": 25,
			"CHAT":		"Print this in chat ever 25 minutes"
		},
		"third_message": {
			"INTERVAL": 32,
			"CHAT":		"Print this in chat ever 30 minutes"
		}
	},
	"COMMENT_TRIGGERED_MESSAGES": [
		"Triggered messages are messages that are sent when a word or phrase or regular expression appears in chat.",
		"As with greetings, they can be CHAT or MEDIA",
		"The word or phrase should be expressed as a regular expression",
		"(see https://www.oreilly.com/content/an-introduction-to-regular-expressions/)",
		"If you don't want to learn regular expressions, just use the word or phrase",
		"If you want to make sure the word or phrase is used at the beginning of a line, like a !command, put a caret (^) before it",
		"Advanced: If you use capture groups in the regex, you can insert those matches in the chat string",
		"by putting in _1_ for the first parameter, _2_ for the second parameter, etc.  This allows complex",
		"responses using the line from chat, like thanking subscribers"
	],
	"TRIGGERED_MESSAGES": {
		"cat": {
			"CHAT":		"Cat was mentioned",
			"MEDIA":	"../sounds/cat-meow-short_nice.mp3"
		},
		"[^a-zA-Z0-9]cat[^a-zA-Z0-9]": {
			"CHAT":		"Cat was mentioned, but guarantees its the word 'cat', not just 'cat' anywhere on the line, including part of another word",
			"MEDIA":	"../sounds/cat-meow-short_nice.mp3"
		},
		"^cat": {
			"CHAT":		"Cat was mentioned at the beginning of a line",
			"MEDIA":	"../sounds/cat-meow-short_nice.mp3"
		},
		"COMMENT": [
			"Timers are created by the !!timer command.  When the timer runs out, these alerts will be triggered.  All timers use the same alerts",
			"The word TIMERNAME will be replaced with the name of the timer given when created, so you can use different media files for each."
		],
		"(LOL|LUL|laugh)": {
			"MEDIA":	"../sounds/laughter-short.mp3"
		},		"^!boss":  {
			"CHAT":		"YOU da boss, USERNAME!"
		}
	},
	"COMMENT_FORBIDDEN_PHRASES": [
		"Forbidden phrases are regular expressions that will cause the user to be banned or timed out, and a message sent to chat",
		"The allowed objects in the responses are CHAT, BLOCK, BAN, and TIMEOUT.  TIMEOUT can specify the number of seconds to time out for",
		"The word or phrase should be expressed as a regular expression",
		"(see https://www.oreilly.com/content/an-introduction-to-regular-expressions/)",
		"If you don't want to learn regular expressions, just use the word or phrase",
		"If you want to make sure the word or phrase is used at the beginning of a line, like a !command, put a caret (^) before it",
		"Advanced: If you use capture groups in the regex, you can insert those matches in the chat string",
		"by putting in _1_ for the first parameter, _2_ for the second parameter, etc.  This allows complex",
		"responses using the line from chat, like thanking subscribers"
	],
	"FORBIDDEN_PHRASES": {
		"pineapple on pizza": {
			"CHAT":		"USERNAME mentioned cursed pizza!",
			"TIMEOUT":	"30"
		},
		"[Vv]oldemort": {
			"CHAT":		["Who? Tom Riddle?", "HE WHO MUST NOT BE NAMED!!"]
		},
		"Dubs are better than subs": {
			"CHAT":		"We do not allow that kind of talk here.  BANNED!",
			"BAN":		"true"
		}
	},
	"COMMENT_TIMER_ALERT": [
		"Timers are created by the !timer command.  When the timer runs out, these alerts will be triggered.  All timers use the same alerts",
		"The word TIMERNAME will be replaced with the name of the timer given when created, so you can use different media files for each."
	],
	"TIMER_ALERT": {
		"CHAT":		"Timer TIMERNAME is done!",
		"MEDIA":	"../sounds/ding-sound-effect_2.mp3"
	}
}
